#mat = "{:20}\t{:28}\t{:32}"
#print(mat.format("占4个长度","占8个长度", "占12长度"))
#如果需要居中输出在宽度前面加一个^
#mat = "{:^20}\t{:^28}\t{:^32}"
#print(mat.format("占4个长度","占8个长度", "占12长度"))
#mat="{:28}{:5}{:20}{:20}"
print("单号：{}".format("DH201409230001"))
print("时间：{}".format("2014-09-23 08：56:14"))
print("---------------------------------------------")
print("名称","        ","数量","单价","金额")
print("{:28}  {} {} {}".format("金士顿U盘8G","1","40.00","40.00"))
print("{}       {} {} {}".format("胜创16GTF卡","1","50.00","50.00"))
print("{}       {} {} {}".format("读卡器","1","8.00","8.00"))
print("{}       {} {} {}".format("网线2米","1","5.00","5.00"))
print("---------------------------------------------")
print("总数：{}    总额： {}".format("4","103.00"))
print("折后总额：{}".format("103.00"))
print("实收:{}找零:{}".format("103.00","0.00"))
print("收银:{}".format("管理员"))
print("---------------------------------------------")


